Revit 2024 API
Space.LimitOffset Property
Get or set the Limit Offset of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double LimitOffset { get; set; }
Visual Basic
Public Property LimitOffset As Double
	Get
	Set
Visual C++
public:
property double LimitOffset {
	double get ();
	void set (double value);
}
Remarks
This property is used to get or set the Limit Offset of the Space.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace